//Создайте класс Concatenation
//Создайте две переменные типа String
//Примените конкатенацию строк и выведите результат в консоль.
//Скомпилируйте созданную программу.
//Запустите программу в терминале

public class Concatenation {
    public static void main(String[] args) {
        String firstPart = "Привет, ";
        String secondPart = "Telran!";
        String result = firstPart + secondPart;
        System.out.println("Результат конкатенации: " + result);
    }
}