package task03;
//Вы открыли банк. У вас есть массив из 100 счетов клиентов. На каждом клиентском счете 1000 евро.
//Просчитайте общее количество денег на счетах клиентов.
//Представьте что за день, у вас в банке было проведено 10 000 операций.
//В каждой операции вы выбираете 2 случайных счета:
//с одного снимаете сумму например 10 евро и добавляете на другой счет эту же сумму.
//Просчитайте общее количество денег на счетах клиентов.
//У вас баланс денежных средств на счетах клиентов до начала операций должен быть равен количеству денег после окончание дня.
//Если это не так, то как Вы думаете почему?  Можно ли это исправить и как?
public class BankSimulation {
}
