//3**
//Вы владелец кафе. Вы предлагаете клиентам блюда собственного приготовления, снеки и алкоголь.
//Сгенерируйте выторг данного кафе (количество на Ваше усмотрение) в формате:
//наименование  тип (кухня, снек, алкоголь)
//сумма (10-100)
//По окончании отчетного периода, вам нужно подсчитать налоги и доход:
//        1) Со всей суммы выторга нужно забрать НДС - 15%.
//        2) С алкоголя, нужно забрать 2% акцизного сбора.
//        3) Снеки облагаются доп.налогом 1%.
//        4) С продуктов кухни нужно снять 10%, как доп.выплату поварам.
//        5) Зарплата сотрудникам рассчитывается как 20% от общей суммы.
//6) Инвесторам нужно выплатить 10 %.
//Вычислите сумму дохода и % составляет доход в от суммы общей выручки?
package cafe;

public class Cafe {
}
